//1. Вывести квадраты чисел от 1 до 5 с использованием цикла for.

// for (let i = 1; i <= 5; i++) {
//   let square = i * i;
//   console.log(`Квадрат числа ${i}: ${square}`);
// }

//2.Вывести числа от 1 до 100, которые делятся на 5 без остатка, с использованием цикла while.

// let i = 1;
// while (i <= 100) {
//   if (i % 5 === 0) {
//     console.log(i);
//   }
//   i++;
// }

//3. Вывести таблицу умножения на 3 с использованием цикла for.

// for (let i = 1; i <= 10; i++) {
//   let result = 3 * i;
//   console.log(`3* ${i} = ${result}`);
// }

//4.Вывести числа от 1 до 50, которые делятся и на 3, и на 5 без остатка, с использованием цикла while.

// let i = 1;
// while (i <= 50) {
//   if (i % 3 === 0 && i % 5 === 0) {
//     console.log(i);
//   }
//   i++;
// }

//5. Посчитать сумму нечетных чисел от 1 до 15 с использованием цикла for.

// let sum = 0;
// for (let i = 1; i <= 15; i += 2) {
//   sum += i;
// }

// console.log(`Сумма чисел: ${sum}`);

//6. : Найти сумму всех чисел, кратных 3 или 5, в диапазоне от 1 до 100.

// let sum = 0;
// for (let i = 1; i <= 100; i++) {
//   if (i % 3 === 0 && i % 5 === 0) {
//     sum += i;
//   }
// }

// console.log(`Сумма чисел равна: ${sum}`);

// 7.Вывести все числа от 1 до 100, которые делятся на 7 без остатка, но не делятся на 5.

// for (let i = 1; i <= 100; i++) {
//   if (i % 7 === 0 && i % 5 !== 0) {
//     console.log(i);
//   }
// }

//8.Посчитать сумму всех цифр в числе 123456789.

// let num = 123456789;
// let sum = 0;

// while (num > 0) {
//   sum += num % 10;
//   num = Math.floor(num / 10);
// }

// console.log(`Сумма цифр 123456789: ${sum}`);

//9.Вывести все простые числа от 1 до 100.

// for (let num = 2; num <= 100; num++) {
//   let simpleNum = true;
//   for (let i = 2; i <= Math.sqrt(num); i++) {
//     if (num % i === 0) {
//       simpleNum = false;
//       break;
//     }
//   }
//   if (simpleNum) {
//     console.log(num);
//   }
// }

//10. : Вывести все числа от 1 до 1000, сумма цифр которых равна 10.

// for (let i = 1; i <= 1000; i++) {
//   let currentNum = i;
//   let sum = 0;
//   while (currentNum > 0) {
//     sum += currentNum % 10;
//     currentNum = Math.floor(currentNum / 10);
//   }
//   if (sum === 10) {
//     console.log(i);
//   }
// }

// 11. : Посчитать сумму первых 10 членов последовательности Фибоначчи.

// let fibonacchi = [0, 1];
// let sum = 0;

// for (let i = 2; i < 10; i++) {
//   fibonacchi[i] = fibonacchi[i - 1] + fibonacchi[i - 2];
// }

// for (let i = 0; i < 10; i++) {
//   sum += fibonacchi[i];
// }

// console.log(`Сумма первых членов Фибоначчи: ${sum}`);

// 12. Найти факториал числа 10.

// let result = 1;

// for (let i = 1; i < 10; i++) {
//   result *= i;
// }
// console.log(`Факториал числа 10: ${result}`);

// 13. : Посчитать сумму квадратов первых 10 натуральных чисел.

// let squareSum = 0;
// for (let i = 1; i < 10; i++) {
//   squareSum += i * i;
// }
// console.log(`Сумма квадратов натуральных чисел: ${squareSum}`);

// 14. Посчитать сумму чисел в следующей последовательности: 1, -2, 3, -4, 5, -6, ..., 99, -100.

// let sum = 0;

// for (let i = 1; i <= 100; i++) {
//   let number = i % 2 === 0 ? -i : i;
//   sum += number;
// }

// console.log(`Сумма чисел : ${sum}`);

//15. Вывести таблицу умножения от 1 до 10

// for (let i = 1; i <= 10; i++) {
//   for (let a = 1; a <= 10; a++) {
//     console.log(`${i}*${a} = ${i * a}`);
//   }
// }

// 16 . Найти сумму всех чисел, кратных 3 или 5, в диапазоне от 1 до 100.

// let sum = 0;

// for (let i = 1; i <= 100; i++) {
//   if (i % 3 === 0 || i % 5 === 0) {
//     sum += i;
//   }
// }

// console.log(`Сумма чисел в диапазоне от 1 до 100: ${sum}`);




